In [399]:
import pandas as pd
p = pd.read_csv('president_heights.csv', skiprows = 5, header=None)
p

     0                       1    2
0    5            James Monroe  183
1    6       John Quincy Adams  171
2    7          Andrew Jackson  185
3    8        Martin Van Buren  168
4    9  William Henry Harrison  173
5   10              John Tyler  183
6   11           James K. Polk  173
7   12          Zachary Taylor  173
8   13        Millard Fillmore  175
9   14         Franklin Pierce  178
10  15          James Buchanan  183
11  16         Abraham Lincoln  193
12  17          Andrew Johnson  178
13  18        Ulysses S. Grant  173
14  19     Rutherford B. Hayes  174
15  20       James A. Garfield  183
16  21       Chester A. Arthur  183
17  23       Benjamin Harrison  168
18  25        William McKinley  170
19  26      Theodore Roosevelt  178
20  27     William Howard Taft  182
21  28          Woodrow Wilson  180
22  29       Warren G. Harding  183
23  30         Calvin Coolidge  178
24  31          Herbert Hoover  182
25  32   Franklin D. Roosevelt  188
26  33         Harry S. Truman  175
27  34    Dwight D. Eisenhower  179
28  35         John F. Kennedy  183
29  36       Lyndon B. Johnson  193
30  37           Richard Nixon  182
31  38             Gerald Ford  183
32  39            Jimmy Carter  177
33  40           Ronald Reagan  185
34  41       George H. W. Bush  188
35  42            Bill Clinton  188
36  43          George W. Bush  182
37  44            Barack Obama  185

In [406]:
df_list = pd.read_html( "https://ourworldindata.org/ofdacred-international-disaster-data" )
len(df_list)

data = requests.get('https://ourworldindata.org/ofdacred-international-disaster-data')

In [402]:
df_table1 = df_list[0]

In [403]:
df_table1

,"Yearly average global annual deaths from natural disasters, by decade",Drought,Earthquake,Extreme temperature,Flood,Impact,Landslide,Mass movement (dry),Storm,Volcanic activity,Wildfire
0,1900s,130000,17302,0,63,0,5,13,1801,4494,0
1,1910s,8500,6280,0,10138,0,0,12,5995,648,107
2,1920s,472400,54935,0,428,0,43,0,11999,514,10
3,1930s,0,23770,169,436147,0,103,4,9384,318,7
4,1940s,345000,16187,0,10103,0,1753,0,12712,213,25
5,1950s,0,2093,150,205830,0,215,0,3126,510,1
6,1960s,150865,5236,113,3239,0,504,218,13393,324,7
7,1970s,11908,44022,155,5078,0,738,7,35734,53,1
8,1980s,55727,6015,534,5155,0,623,127,4667,2400,40
9,1990s,311,10359,932,9549,0,833,87,21115,97,86
10,2000s,115,45364,9106,5401,0,772,28,17213,24,63
11,2010s,3339,43302,11644,5811,0,1069,13,3177,71,52

In [411]:
import numpy as np
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'], 'data1' : np.random.randn(5), 'data2' : np.random.randn(5)})

In [412]:
df

  key1 key2     data1     data2
0    a  one -0.270842  0.333743
1    a  two  1.408168  0.333866
2    b  one  0.691409 -0.145442
3    b  two -0.454636  1.590690
4    a  one  0.497924  0.525160

In [414]:
df['data1'].groupby(df['key1'])
for group in df['data1'].groupby(df['key1']):
    print(group)

('a', 0   -0.270842
1    1.408168
4    0.497924
Name: data1, dtype: float64)
('b', 2    0.691409
3   -0.454636
Name: data1, dtype: float64)

In [415]:
for name, group in df['data1'].groupby(df['key1']):
    print(name)
    print(group)

a
0   -0.270842
1    1.408168
4    0.497924
Name: data1, dtype: float64
b
2    0.691409
3   -0.454636
Name: data1, dtype: float64

In [425]:
grouped = df['data1'].groupby(df['key1'])

In [426]:
grouped.mean()

key1
a    0.545083
b    0.118387
Name: data1, dtype: float64

In [429]:
df['data2'].groupby(df['key1']).sum()

key1
a    1.192770
b    1.445249
Name: data2, dtype: float64

In [430]:
 means = df['data1'].groupby([df['key1'], df['key2']]).mean()
df

  key1 key2     data1     data2
0    a  one -0.270842  0.333743
1    a  two  1.408168  0.333866
2    b  one  0.691409 -0.145442
3    b  two -0.454636  1.590690
4    a  one  0.497924  0.525160

In [129]:
means

key1  key2
a     one    -0.595519
      two    -0.048241
b     one     1.244966
      two    -0.995720
Name: data1, dtype: float64

In [130]:
means.unstack()

key2       one       two
key1
a    -0.595519 -0.048241
b     1.244966 -0.995720

In [431]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [432]:
years = np.array([2005, 2005, 2006, 2005, 2006])
population = np.array([1908745, 789465166, 574875459,4544646,4545454])

In [433]:
df1 = pd.DataFrame({'states':states, 'years': years, 'population': population})
df1

       states  years  population
0        Ohio   2005     1908745
1  California   2005   789465166
2  California   2006   574875459
3        Ohio   2005     4544646
4        Ohio   2006     4545454

In [435]:
df1['population'].groupby([df1['years'], df1['states']]).mean()

years  states
2005   California    789465166.0
       Ohio            3226695.5
2006   California    574875459.0
       Ohio            4545454.0
Name: population, dtype: float64

In [166]:
df1.groupby([df1['years'], df1['states']]).size()

years  states
2005   California    1
       Ohio          2
2006   California    1
       Ohio          1
dtype: int64

In [175]:
for name, group in df1.groupby(df1['years']):
    print("name is ", name)
    print("group is", group)

name is  2005
group is        states  years  population
0        Ohio   2005     1908745
1  California   2005   789465166
3        Ohio   2005     4544646
name is  2006
group is        states  years  population
2  California   2006   574875459
4        Ohio   2006     4545454

In [183]:
for name, group in df1.groupby(df1['years'])['population']:
    print(name)
    print(group)

2005
0      1908745
1    789465166
3      4544646
Name: population, dtype: int32
2006
2    574875459
4      4545454
Name: population, dtype: int32

In [184]:
g = df1.groupby(df1['years'])

In [187]:
for group in g:
    print(group)

(2005,        states  years  population
0        Ohio   2005     1908745
1  California   2005   789465166
3        Ohio   2005     4544646)
(2006,        states  years  population
2  California   2006   574875459
4        Ohio   2006     4545454)

In [437]:
marks = pd.read_excel('student_details.xlsx')

In [438]:
data = pd.DataFrame(marks)
data

    Student Id     Name Course                Subject  Marks
0       383080      Ray     AI                 Python     85
1       383080      Ray     AI      Data Manipulation     80
2       383080      Ray     AI          Visualization     90
3       412290   Amreen     ML             Regression     85
4       412290   Amreen     ML    Supervised learning     89
5       412290   Amreen     ML  Unsupervised Learning     84
6       412290   Amreen     ML                  Maths     86
7       412290   Amreen     ML                     PE     85
8       218895  Loralai     DS                 Hadoop     82
9       218895  Loralai     DS                  Spark     90
10      218895  Loralai     DS                 Python     86
11      218895  Loralai     DS                     DM     95

In [446]:

data.groupby(data['Course'])['Marks'].sum()

Course
AI    255
DS    353
ML    429
Name: Marks, dtype: int64

In [454]:

import pandas as pd
df = pd.read_excel("student_details.xlsx")

df.groupby('Course')["Marks"].sum()

Marks_total = df.groupby('Course')["Marks"].sum().rename("Marks_Total").reset_index()

df_1 = df.merge(Marks_total)

df_1["Percent_of_marks"] = df_1["Marks"] / df_1["Marks_Total"]
df_1

,Student Id,Name,Course,Subject,Marks,Marks_Total,Percent_of_marks
0,383080,Ray,AI,Python,85,255,0.333333
1,383080,Ray,AI,Data Manipulation,80,255,0.313725
2,383080,Ray,AI,Visualization,90,255,0.352941
3,412290,Amreen,ML,Regression,85,429,0.198135
4,412290,Amreen,ML,Supervised learning,89,429,0.207459
5,412290,Amreen,ML,Unsupervised Learning,84,429,0.195804
6,412290,Amreen,ML,Maths,86,429,0.200466
7,412290,Amreen,ML,PE,85,429,0.198135
8,218895,Loralai,DS,Hadoop,82,353,0.232295
9,218895,Loralai,DS,Spark,90,353,0.254958
10,218895,Loralai,DS,Python,86,353,0.243626
11,218895,Loralai,DS,DM,95,353,0.269122

In [469]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'
flowers = pd.read_csv(url,header=None,names=['a','b','c','d','e'])
flowers

       a    b    c    d               e
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [470]:
flowers.rename(columns={'a':'sepal_l','b':'sepal_w', 'c':'petal_l','d':'petal_w','e':'species'}, inplace = True)
flowers

     sepal_l  sepal_w  petal_l  petal_w         species
0        5.1      3.5      1.4      0.2     Iris-setosa
1        4.9      3.0      1.4      0.2     Iris-setosa
2        4.7      3.2      1.3      0.2     Iris-setosa
3        4.6      3.1      1.5      0.2     Iris-setosa
4        5.0      3.6      1.4      0.2     Iris-setosa
..       ...      ...      ...      ...             ...
145      6.7      3.0      5.2      2.3  Iris-virginica
146      6.3      2.5      5.0      1.9  Iris-virginica
147      6.5      3.0      5.2      2.0  Iris-virginica
148      6.2      3.4      5.4      2.3  Iris-virginica
149      5.9      3.0      5.1      1.8  Iris-virginica

[150 rows x 5 columns]

In [475]:
print(flowers.describe())

          sepal_l     sepal_w     petal_l     petal_w
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.054000    3.758667    1.198667
std      0.828066    0.433594    1.764420    0.763161
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [483]:
a = [1,2,3]
b=  [3,4,5]

In [485]:
n1 = np.array([1,2,3])
n2 = np.array([3,4,5])

In [500]:
d = np.append(n1,n2)
d1 = np.unique(d)
print(d1)

[1 2 3 4 5]

In [502]:
from sklearn.preprocessing import LabelEncoder
D = ['A','B','B','C','D','E','B','A']
le = LabelEncoder()
print(le.fit_transform(D))

[0 1 1 2 3 4 1 0]

In [505]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
# creating initial dataframe
bridge_types = ('Arch','Beam','Truss','Cantilever','Tied Arch','Suspension','Cable')
bridge_df = pd.DataFrame(bridge_types, columns=['Bridge_Types'])
print(bridge_df)
# creating instance of labelencoder
l = LabelEncoder()
# Assigning numerical values and storing in another column
bridge_df['Bridge_Types_Cat'] = l.fit_transform(bridge_df['Bridge_Types'])
bridge_df

  Bridge_Types
0         Arch
1         Beam
2        Truss
3   Cantilever
4    Tied Arch
5   Suspension
6        Cable

  Bridge_Types  Bridge_Types_Cat
0         Arch                 0
1         Beam                 1
2        Truss                 6
3   Cantilever                 3
4    Tied Arch                 5
5   Suspension                 4
6        Cable                 2

In [417]:
st = pd.DataFrame({'student':['A','A','B'], 'program':['ML','ML','AI'],'course':['DS','Python','DS'],'Marks':[50,48,56]})

In [418]:
st

  student program  course  Marks
0       A      ML      DS     50
1       A      ML  Python     48
2       B      AI      DS     56

In [436]:
st.groupby(st['program'])['course'].size()

program
AI    1
ML    2
Name: course, dtype: int64

In [424]:
for name, group in st.groupby(st['program'])['course']:
    print(name)
    print(group)

AI
2    DS
Name: course, dtype: object
ML
0        DS
1    Python
Name: course, dtype: object

In [507]:
data = pd.DataFrame({'elec' : [2000,2500,3000], 'month':[1,2,3]})

In [531]:
d = pd.concat([data]*30, ignore_index=True)
d

    elec  month
0   2000      1
1   2500      2
2   3000      3
3   2000      1
4   2500      2
..   ...    ...
85  2500      2
86  3000      3
87  2000      1
88  2500      2
89  3000      3

[90 rows x 2 columns]

In [534]:
n = pd.Series(range(1,31))

pd.DataFrame({'month':[1,2,3], 'days':range(1,10)})

ValueError: arrays must all be same length